Repository: Python3pkg/Products.SilvaDocument
Catalog: i18n/silva_document-*.po
Languages: fr

source: A Document is the basic unit of information in Silva. A document can - much like word processor documents - contain text, lists, tables, headers, subheads, images, etc. Documents can have two (accessible) versions, one online for the public, another in process (editable or approved).
fr: Un document est l'unité de base d'information. Un document peut contenir texte, listes, tables, entêtes, sous-entêtes, images,etc. Ils peuvent exister deux versions des documents, une en ligne pour le public, et une autre en cours de préparation ou d'édition (à publier ou à approuver).

source: No charset entered
fr: Vous n'avez pas choisi un jeu de caractères

source: Charset set
fr: Choisir jeu de caractères

source: title
fr: titre

source: paragraph
fr: paragraphe

source: heading
fr: Entête

source: list
fr: liste

source: preformatted
fr: préformatté

source: table of contents
fr: Tableau de contenus

source: table
fr: tableau

source: complex list
fr: liste complexe

source: definition list
fr: liste de définitions

source: code element
fr: élément de code

source: external source
fr: source externe

source: Paragraph
fr: Paragraphe

source: Heading
fr: Entête

source: List
fr: Liste

source: Complex list
fr: Liste complexe

source: List item
fr: Liste items

source: List title
fr: Liste titre

source: Preformatted
fr: Préformatté

source: Definition list
fr: Liste des définitions

source: row
fr: colonne

source: row heading
fr: entête de colonne

source: Unknown Editor: ${editor}
fr: Editeur:Inconnu ${editor}

source: no ${path} element
fr: aucun élément ${path}

source: more than one ${path} element
fr: plus d'un élément ${path}

source: intermingling * is not allowed ${i}
fr: imélanger * n'est pas permis ${i}

source: not implemented, override in inheriting class
fr: non implémenté, outrepasser les classes héritées

source: ${name} attribute not found on tag ${self}
fr: attribut ${name} absent dans tag ${self}

source: No spaces or special characters besides &#8216;_&#8217; or &#8216;-&#8217; or &#8216;.&#8217;
fr: Aucun espace ou cacractère spécial autre que &#8216;_&#8217; or &#8216;-&#8217; or &#8216;.&#8217;

source: forms editor
fr: editeur formes

source: forms editor...
fr: editeur formes...

source: editor
fr: editeur

source: preview
fr: apperçu

source: properties
fr: propriétés

source: access
fr: accès

source: publish
fr: Publication

source: kupu editor...
fr: éditeur kupu...

source: kupu editor
fr: éditeur kupu

source: edit with the forms editor: alt-)
fr: éditer avec l'éditeur de formes: alt-)

source: edit with the kupu WYSIWYG editor: alt-(
fr: éditer avec l'éditeur kupu: alt-(

source: author
fr: auteur

source: The citation may contain multiple paragraphs. Separate them with an empty line.
fr: La citation peut contenir plusieurs paragraphes. Séparez-les avec une ligne vide

source: Code element is broken
fr: l'élément de code est cassé

source: Code element: ${title_or_id} at ${path}
fr: Element de code: ${title_or_id} à ${path}

source: They should be located in a (non-Silva) folder in the ZMI named ${code_source}.
fr: Ils peuvent se retrouver dans un dossier (non-Silva) de la ZMI nommé ${code_source}.

source: Available code objects:
fr: Objets code disponibles:

source: Select the code to be executed when document is displayed.
fr: Choisir le programme à exécuter quand le document est affiché

source: No code objects (Python Scripts, Page Templates, DTML Methods) are available.
fr: Aucun objet (Python Scripts, Page Templates, DTML Methods) disponible

source: Add term on first line, definition on second line. Separate items with an empty line space.
fr: Ajouter le terme dans la première ligne, la définition dans la deuxième. Séparer les items avec un espace vide d'une ligne

source: ${tip} Tab to the exit button or alt-e.
fr: touche ${tip} pour la sortie alt-e.

source: Normal heading
fr: Entête normal

source: Sub heading
fr: Sosus-entête

source: Sub sub heading
fr: Sous sous-entête

source: Paragraph heading
fr: Entête de paragraphe

source: Sub paragraph heading
fr: Sous-entête de paragraphe

source: float right
fr: flottant à droite

source: align right
fr: aligné à droite

source: Use &#8220;get image reference...&#8221; (alt-g) to locate an image, or type in the full path.
fr: Utliser &#8220;référence image...&#8221; (alt-g) pour trouver une image, ou taper son chemin complet.

source: Set an optional target for the link. Turning on &#8220;new window&#8221; inserts &#8216;_blank&#8217; after saving.
fr: Placez une cible optionnelle pour le lien. Turning on &#8220;new window&#8221; crée &#8216;_blank&#8217; après sauvegarde.

source: It&#8217;s good practice to give the link of an image a title, which will appear as a tooltip.
fr: Il est conseillé de donner un titre au lien de l'image, lequel apparaîtra au passage du curseur souris sur l'image

source: A float alignment allows the next document element to wrap &#8211; if there&#8217;s room.
fr: Un alignment flottant permet à l'élément document suivant de coller au format #8211; if there&#8217; défini

source: get image reference...
fr: Placez une référence d'image...

source: access key: alt-g
fr: touche d'accès: alt-g

source: edit image
fr: editer image

source: create a hyperlink: alt-l
fr: créer un hyperlien

source: High resolution version of image
fr: Version d'image haute résolution

source: target frame
fr: cadre cible

source: new window
fr: nouvelle fenêtre

source: tooltip for link
fr: astuce pour lien

source: image alignment
fr: alignement image

source: float left
fr: flottement à gauche

source: align left
fr: alignement à gauche

source: default
fr: par défaut

source: align center
fr: alignement centré

source: image element is broken
fr: l'élément image est indisponible

source: image reference is broken
fr: la référence de l'image est indisponible

source: Add list items separated by an empty line.
fr: Ajouter liste d'éléments séparés par une ligne vide

source: create a hyperlink: alt-g
fr: créer un hyperlien: alt-g

source: get link reference...
fr: établir une référence au lien ...

source: element
fr: élément

source: normal
fr: create a hyperlink: alt-g

source: annotation
fr: notes

source: Tip:
fr: Conseil:

source: Multiple paragraphs can be entered in one step by adding an empty line space.
fr: Paragraphes multiples peuvent être rajoutés d'un seul coup, en ajoutant un espace ligne vide

source: none
fr: aucun

source: Preformatted text will be shown exactly as entered, with all characters displayed literally. White space is preserved (unless the textarea is empty).
fr: Les textes préformattés seront montrés exactement comme ils ont étés renseignés, avec tous les caractères montrés littéralement. Les espaces en blanc seront préservés (sauf si la zone de texte est vide).

source: ${tip} tab to the exit button or alt-e.
fr: touche ${tip} pour la sortie alt-e.

source: source id
fr: id source

source: Select an External Source...
fr: Choisir source externe

source: update
fr: mettre à jor

source: access key: alt-u
fr: touche d'accès: alt-u

source: Select a source from the pulldown list.
fr: Choisir une source dans la liste

source: Hit "update" to refresh the reference.
fr: Utiliser "update" pour actualiser la référence

source: Fill in the parameters (if necessary).
fr: Remplir les paramètres (si nécessaire).

source: Source description:
fr: Description de la source:

source: Source is a NoneType - is it not available anymore?
fr: La source est sans type , n'est plus disponible

source: title:
fr: titre:

source: No parameters to be filled for this source.
fr: Aucun paramètre à remplir pour cette source

source: Source parameters
fr: Paramètres de la source

source: external source element is broken
fr: L'élément de source externe est indisponible

source: error message:
fr: message d'errreur:

source: Unfortunately however, there no error message available...
fr: Désolé, pas de message d'erreur disponible...

source: Table of contents depth:
fr: Table de contenus -niveaux:

source: 1 level
fr: 1 niveau

source: ${n} levels
fr: ${n} niveaux

source: unlimited
fr: illimité

source: nest element
fr: élément imbriqué

source: nest elements
fr: éléments imbriqués

source: delete element
fr: efface élément

source: move down
fr: déplacer vers le bas

source: move up
fr: déplacer vers le haut

source: up to top of page
fr: déplacer vers le début de la page

source: save
fr: sauvegarder

source: access key: alt-s
fr: touche d'accès: alt-s

source: save + exit
fr: sauvegarder et quitter

source: access key: alt-e
fr: touche d'accès: alt-e

source: save + insert
fr: sauvegarder et insérer

source: access key: alt-i
fr: touche d'accès: alt-i

source: insert element
fr: insérez élément

source: insert item
fr: insérez item

source: insert line item
fr: insérez ligne item

source: add element&nbsp;
fr: ajouter élément&nbsp;

source: insert
fr: insérez

source: edit element
fr: éditer élément

source: if ${target} is empty a new window opens
fr: si ${target} est vide, une nouvelle fenêtre s'ouvre

source: target
fr: cible

source: index item
fr: item index

source: full name
fr: nom complet

source: acronym
fr: acronyme

source: bold
fr: Gras

source: Text can be formatted &#8211; in ${italic}, ${bold}, etc. &#8211; with ${silva_markup}:
fr: Le text peut être formatté &#8211; in ${italic}, ${bold}, etc. &#8211; avec ${silva_markup}:

source: italic
fr: Italique

source: subscript
fr: souscrire

source: underlined
fr: Souligné

source: text
fr: texte

source: subeditor
fr: sous-éditeur

source: disc bullets
fr: puces rondes

source: square bullets
fr: puces carrées

source: circle bullets
fr: puces cercle

source: no bullet
fr: aucune puce

source: Up to parent: alt-u
fr: Vers parent: alt-u

source: edit parent
fr: éditer parent

source: Nested element editor
fr: Editeur d'éléments imbriqués

source: Up to parent
fr: Vers parent

source: column settings
fr: paramètres colonne

source: accesskey: alt-a
fr: raccourci: alt-a

source: add column
fr: ajouter colonne

source: delete column
fr: effacer colonne

source: accesskey: alt-d
fr: raccourci: alt-d

source: relative width
fr: largeur relative

source: Plain table (bold heading, no borders)
fr: Tableau plein (entête gras, sans bords)

source: List table (bold underlined heading, borderless rows)
fr: Tableau liste (entête surligné gras, sans quadrillage)

source: Grid table (bold bordered heading, bordered rows)
fr: Tableau grille (entête encadré gras, avec quadrillage)

source: Data grid table (bold borderless heading, bordered rows)
fr: Tableau grille de données (entête gras, sans bordure, quadrillage externe)
